function r = r_M_0(theta)
    %%%% Ѕольше примеров на сайте https://habr.com/ru/post/519954/?

    % ѕример 1: “очка в центре (0,0)
     r = 0.01;
    
    
    % ѕример 2: ≈диничный круг с центром (0,0)
    % r = 1;
    
    
    % ѕример 3:  руг радиусом R с центром (0,0)
    % R = pi;
    % r = R;
    
    
    
    % ѕример 4: 
    % вадрат стороной 2, 
    %в центре (0,0) 
    %развернутый на 0 градусов относительно оси OX по часовой стрелке
    %задаетс€ в декартовых координатах так: 
    %%%%|x| <= 1, |y| <= 1,
    %%%%max(|x|,|y|) = 1
    
    % параметры:
    % r = sqrt( 2 ./ ( 1 + sqrt( 1 - (sin(2.*theta)).^2 ) ) ); 
    
    
    
    % ѕример 5: 
    % вадрат стороной a, 
    %в центре (0,0) 
    %развернутый на 0 градусов относительно оси OX по часовой стрелке
    %задаетс€ в декартовых координатах так: 
    %%%%|x| <= a/2, |y| <= a/2,
    %%%%max(|x|,|y|) = a/2
    
    % параметры:
    % a = 1;
    % r = (a/2).*sqrt( 2 ./ ( 1 + sqrt( 1 - (sin(2.*theta)).^2 ) ) ); 
    
    
    
    % ѕример 6: 
    % вадрат стороной a, 
    %в центре (0,0) 
    %развернутый на alpha градусов относительно оси OX по часовой стрелке
    %задаетс€ в декартовых координатах так: 
    %%%%|xcos(alpha) + ysin(alpha)| <= a/2, |-xsin(alpha) + ycos(alpha)| <= a/2,
    %%%%max(|xcos(alpha) + ysin(alpha)|,|-xsin(alpha) + ycos(alpha)|) = a/2
    
    % параметры:
    % a = 1;
    % alpha = pi/4;
    % r = (a/2).*sqrt( 2 ./ ( 1 + sqrt( 1 - (sin(2.*(theta-alpha))).^2 ) ) ); 
    
    
    
    % ѕример 7: 
    %ѕр€моугольник стороной 2a по X, стороной 2b по Y 
    %в центре (0,0) 
    %развернутый на alpha градусов относительно оси OX по часовой стрелке
    %задаетс€ в декартовых координатах так: 
    %%%%|x| <= a, |y| <= b,
    %%%%max(|x| - a,|y| - b) = 0
    
    % параметры:
    % a = 1;
    % b = 2;
    % alpha = pi/4;
    % r1 = (a*b)^2 ;
    % r2 = ( (b^2-a^2).*cos(2.*(theta-alpha)) + a^2 + b^2  );
    % r3 = ( (a^2+b^2).*cos(2.*(theta-alpha)) - a^2 + b^2  ).^2;
    % r4 = ( (b^2-a^2).*cos(2.*(theta-alpha)) + a^2 + b^2  ).^2;
    % r = 2*sqrt( r1 ./ ( r2.*(1 + sqrt(  r3./r4  ) ) ) );
    
    
    
end